;------------------------------------------------------------------------------
; UltraDefrag GUI Finnish Language Pack.
; Copyright (C) 2010 by Stefan Pendl.
; Copyright (C) 2010, 2011 by jtl.
;------------------------------------------------------------------------------
; History --- Date ---------- Full Name
;------------------------------------------------------------------------------
; Revised {Jan. 01, 1900} by {Replace with your name}
;------------------------------------------------------------------------------

; Please keep the header and comments in English and use Latin letters,
; so everyone understands them

; THIS FILE MUST BE SAVED IN UNICODE (UTF-16) ENCODING
; Use \n as a newline character in strings.
; Use an ampersand (&) before a letter to make it a keyboard accelerator


; Main Menu

ACTION                    = &Valinta
REPORT                    = &Raportti
SETTINGS                  = A&setukset
HELP                      = &Apua

; --- Action Menu

ANALYSE                   = &Analysoi
DEFRAGMENT                = &Eheytä
QUICK_OPTIMIZE            = Pika&optimoi
FULL_OPTIMIZE             = &Täysoptimoi
OPTIMIZE_MFT              = Optimoi &MFT
STOP                      = &Lopeta
SKIP_REMOVABLE_MEDIA      = Ohita &siirrettävät asemat
RESCAN_DRIVES             = Skannaa &uudelleen
WHEN_DONE                 = &Kun valmis, niin...
EXIT                      = &Poistu

; --- --- When done submenu

WHEN_DONE_NONE            = &ei mitään
WHEN_DONE_EXIT            = &poistu
WHEN_DONE_STANDBY         = siirry &valmiustilaan
WHEN_DONE_HIBERNATE       = siirry &lepotilaan
WHEN_DONE_LOGOFF          = &kirjaudu ulos
WHEN_DONE_REBOOT          = käynnistä &uudelleen
WHEN_DONE_SHUTDOWN        = &sulje

; --- Report Menu

SHOW_REPORT               = &Näytä raportti

; --- Settings Menu

LANGUAGE                  = &Kieli
GRAPHICAL_INTERFACE       = &Graafinen liittymä
BOOT_TIME_SCAN            = &Skannaus Windows-käynnistyksen myötä
REPORTS                   = &Raportit

; --- --- Language submenu

TRANSLATIONS_FOLDER       = &Kielitiedostojen kansio

; --- --- Graphical interface submenu

FONT                      = &Fontti
OPTIONS                   = &Optiot

; --- --- Boot time scan submenu

ENABLE                    = &Käytä
SCRIPT                    = &Skripti

; --- Help Menu

CONTENTS                  = &Sisältö
BEST_PRACTICE             = &Parhaat käytännöt
FAQ                       = &FAQ
ABOUT                     = &Ohjelmasta

; --- Toolbar Tooltips

BOOT_TIME_SCRIPT          = Windows-käynnistyksen aikainen suoritus

; Drives list items.

VOLUME                    = Asema
STATUS                    = Tilanne
TOTAL                     = Koko
FREE                      = Vapaana
PERCENT                   = Osuus

; Status messages

STATUS_RUNNING            = Käynnissä
STATUS_ANALYSED           = Analysoitu
STATUS_DEFRAGMENTED       = Eheytetty
STATUS_OPTIMIZED          = Optimoitu

; Status bar messages.

DIRS                      = kansiota
FILES                     = tiedostoa
FRAGMENTED                = pirstoutunutta
COMPRESSED                = pakattua
MFT                       = MFT

; About window.

ABOUT_WIN_TITLE           = Tietoja Ultra Defragmenterista
CREDITS                   = Kiitokset
LICENSE                   = Lisenssi

; Shutdown confirmation

PLEASE_CONFIRM            = Vahvista
REALLY_SHUTDOWN_WHEN_DONE = Haluatko sammuttaa koneen tehtävän päätteeksi?
REALLY_HIBERNATE_WHEN_DONE= Haluatko koneen lepotilaan tehtävän päätteeksi?
REALLY_LOGOFF_WHEN_DONE   = Haluatko todella kirjautua suorituksen jälkeen ulos?
REALLY_REBOOT_WHEN_DONE   = Haluatko todella käynnistää koneen suorituksen jälkeen uudelleen?
SECONDS_TILL_SHUTDOWN     = sekuntia koneen sammutukseen
SECONDS_TILL_HIBERNATION  = sekuntia lepotilaan siirtymiseen
SECONDS_TILL_LOGOFF       = sekuntia uloskirjautumiseen
SECONDS_TILL_REBOOT       = sekuntia uudelleenkäynnistykseen
YES                       = Kyllä
NO                        = Ei

; END OF FILE
